import numpy as np

x=np.array([[1,2,3],
            [4,5,6],
            [7,8,9]])
y=np.array([[9,8,7],
            [6,5,4],
            [3,2,1]])

print(x+y)#要素ごとの足し算

x=np.array([1,2,3])#1行3列 1次元配列と多次元配列は最後の次元のサイズが一致していれば計算可能
y=np.array([[5,6,7],
            [8,9,10]])#2行3列
print(x+y)

x=np.array([[2],
            [3],
            [4]])#3行1列 N行1列と多次元配列は最後から2番目の次元のサイズが一致していれば計算可能
y=np.array([[5,6,7],
            [8,9,10],
            [11,12,13]])#3行3列
print(x+y)

x=np.array([[1,2,3],
            [4,5,6]])#2行3列
y=np.array([[7,8,9],
            [10,11,12],
            [13,14,15]])#3行3列
print(np.dot(x,y))#数学の行列計算のドット積